#### Terraform Format and Style 🖌
#### Environment staging (CD)
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
confluent_environment.env: Refreshing state... [id=env-nkp5pk]
confluent_service_account.platform-manager: Refreshing state... [id=sa-0pv239]
confluent_kafka_cluster.standard: Refreshing state... [id=lkc-0666vp]
confluent_role_binding.platform-manager-kafka-cluster-admin: Refreshing state... [id=rb-JW51N1]
confluent_api_key.platform-manager-kafka-api-key: Refreshing state... [id=CJGRWEPSPX6DREIF]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # confluent_environment.env has been deleted
  - resource "confluent_environment" "env" {
      - id            = "env-nkp5pk" -> null
        # (2 unchanged attributes hidden)
    }

  # confluent_kafka_cluster.standard has been deleted
  - resource "confluent_kafka_cluster" "standard" {
      - api_version        = "cmk/v2" -> null
      - id                 = "lkc-0666vp" -> null
      - kind               = "Cluster" -> null
      - rbac_crn           = "crn://confluent.cloud/organization=0181937b-ba59-454c-871e-302b1ecb111e/environment=env-nkp5pk/cloud-cluster=lkc-0666vp" -> null
        # (6 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluent_api_key.platform-manager-kafka-api-key will be created
  + resource "confluent_api_key" "platform-manager-kafka-api-key" {
      + description            = "Kafka API Key that is owned by 'platform-manager' service account"
      + disable_wait_for_ready = false
      + display_name           = "platform-manager-kafka-api-key"
      + id                     = (known after apply)
      + secret                 = (sensitive value)

      + managed_resource {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)

          + environment {
              + id = (known after apply)
            }
        }

      + owner {
          + api_version = "iam/v2"
          + id          = "sa-0pv239"
          + kind        = "ServiceAccount"
        }
    }

  # confluent_environment.env will be created
  + resource "confluent_environment" "env" {
      + display_name  = "staging"
      + id            = (known after apply)
      + resource_name = (known after apply)
    }

  # confluent_kafka_cluster.standard will be created
  + resource "confluent_kafka_cluster" "standard" {
      + api_version        = (known after apply)
      + availability       = "SINGLE_ZONE"
      + bootstrap_endpoint = (known after apply)
      + cloud              = "AWS"
      + display_name       = "standard_kafka_cluster"
      + id                 = (known after apply)
      + kind               = (known after apply)
      + rbac_crn           = (known after apply)
      + region             = "us-east-2"
      + rest_endpoint      = (known after apply)

      + environment {
          + id = (known after apply)
        }

      + standard {}
    }

  # confluent_role_binding.platform-manager-kafka-cluster-admin will be created
  + resource "confluent_role_binding" "platform-manager-kafka-cluster-admin" {
      + crn_pattern = (known after apply)
      + id          = (known after apply)
      + principal   = "User:sa-0pv239"
      + role_name   = "CloudClusterAdmin"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

</details>
*Pushed by: @ddziara, Action: `pull_request`*